frontend/controllers/CellsController.php

SELECT * FROM `region` ORDER BY `name`
---
    public function actionCreate()
    {
        $model = new Cells();
        if ($model->load(Yii::$app->request->post())) {
            $model->date_exit=$model->getDate($model->date_exit);
            $model->date_reg=$model->getDate(date('c'));
            $model->user_id=Yii::$app->user->getId();
            if($model->save())
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            $model_region=Region::find()->orderBy('name ASC')->all();

SELECT * FROM `cells` WHERE `id`='8'
---
    protected function findModel($id)
    {
        if (($model = Cells::findOne($id)) !== null) {