frontend/models/SignupForm.php

    public function signup($type)
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->save(false);
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('vitia', 'vitia@gmail.com', '$2y$13$oUx1vEdNdxiGQXpPkg49LukviaNnK82cgOTiKmMpJUXe2TSaWEB32', 'KQRzuOVle_s0bRwTAYHSnXR8joU2UgSW', 1513888164, 1513888164)