frontend/models/User.php

    public function getCount()
    {
        return Cells::find()->where(['user_id'=>$this->id])->count();
---
SELECT COUNT(*) FROM `cells` WHERE `user_id`=1